
&НаКлиенте
Процедура Расш1_ЗУПСписокПриАктивизацииСтрокиПосле(Элемент)

	Если Элемент.ТекущаяСтрока = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если ПроверкаПроведнностиДокумента(Элемент.ТекущаяСтрока) Тогда 
		ЭтаФорма.Элементы.КомандаПечатиТ13.Видимость = Истина;
	Иначе 
		ЭтаФорма.Элементы.КомандаПечатиТ13.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПроверкаПроведнностиДокумента(ТекущаяСтрока)
	Возврат ТекущаяСтрока.Проведен;
КонецФункции 

&НаКлиенте
Процедура Расш1_ЗУПКомандаПечатиТ13После(Команда)
	ОткрытьФорму("Отчет.УнифицированнаяФормаТ13.ФормаОбъекта");
КонецПроцедуры
