
// Формирует структуру запроса JSON-RPC
//
// Параметры:
//   Метод - Строка - название запрашиваемого метода.
//   Параметры - Структура - параметры запрашиваемого метода.
//   ИдентификаторЗапроса - Число - идентификатор запроса для дальнейшего отслеживания ответа.
//
// Возвращаемое значение:
//   Структура - Структура со свойствами:
//     * jsonrpc - Строка - версия протокола, всегда "2.0".
//     * method - Строка - название запрашиваемого метода.
//     * params - Структура - параметры запрашиваемого метода.
//     * id - Число - идентификатор запроса для дальнейшего отслеживания ответа.
//
Функция НовыйЗапрос(Метод=Неопределено, Параметры=Неопределено, ИдентификаторЗапроса=1) Экспорт

	Запрос = Новый Структура("jsonrpc, method, params, id");
	Запрос.jsonrpc = "2.0";
	Запрос.method = Метод;
	Запрос.params = Параметры;
	Запрос.id = ИдентификаторЗапроса;

	Возврат Запрос;

КонецФункции

Функция ОписаниеJSONRPCОшибки(Ошибка) Экспорт
	Возврат "" + Ошибка["code"] + ". " + Ошибка["message"] + ?(Ошибка.Получить("data") <> Неопределено, ": " + Ошибка["data"], "") + ".";	 
КонецФункции
