
// Информационные 100 - 199
// Успешные 200 - 299
// Перенаправления 300 - 399
// Клиентские ошибки 400 - 499
// Серверные ошибки 500 - 599
&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Если ЗначениеЗаполнено(Запись.КодСостояния) Тогда  
		Если Число(Запись.КодСостояния) >= 200 И Число(Запись.КодСостояния) <= 299 Тогда
			ЭтаФорма.Элементы.КодСостояния.ЦветТекста = WebЦвета.Зеленый;
		КонецЕсли;
		
		Если Число(Запись.КодСостояния) >= 100 И Число(Запись.КодСостояния) <= 199 Тогда
			ЭтаФорма.Элементы.КодСостояния.ЦветТекста = WebЦвета.ОранжевоКрасный;
		КонецЕсли;

		Если Число(Запись.КодСостояния) >= 300 И Число(Запись.КодСостояния) <= 399 Тогда
			ЭтаФорма.Элементы.КодСостояния.ЦветТекста = WebЦвета.Черный;
		КонецЕсли;

		Если Число(Запись.КодСостояния) >= 400 И Число(Запись.КодСостояния) <= 499 Тогда
			ЭтаФорма.Элементы.КодСостояния.ЦветТекста = WebЦвета.ОранжевоКрасный;
		КонецЕсли;

		Если Число(Запись.КодСостояния) >= 500 И Число(Запись.КодСостояния) <= 599 Тогда
			ЭтаФорма.Элементы.КодСостояния.ЦветТекста = WebЦвета.Красный;
		КонецЕсли;
	
	КонецЕсли;

КонецПроцедуры
