
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КлючОбъекта  = "ОбработкаНастройкаИнтеграции";
	КлючНастроек = "ЛогированиеСервиса";
	
	ДанныеПонастройкамИнтеграции = ХранилищеОбщихНастроек.Загрузить(КлючОбъекта, КлючНастроек);

	Если ДанныеПонастройкамИнтеграции <> Неопределено Тогда 
		Если ДанныеПонастройкамИнтеграции.Количество() > 0 Тогда 
			СписокМетодов.ЗагрузитьЗначения(ДанныеПонастройкамИнтеграции);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиИнтеграции()

	КлючОбъекта  = "ОбработкаНастройкаИнтеграции";
	КлючНастроек = "ЛогированиеСервиса";

		НастройкиИнтеграции = Новый Массив;
		Для Каждого СтрокаСписка Из СписокМетодов Цикл 
			Если СтрокаСписка.Значение <> "" Тогда  
				НастройкиИнтеграции.Добавить(СтрокаСписка);
			КонецЕсли;
		КонецЦикла;

	ХранилищеОбщихНастроек.Сохранить(КлючОбъекта, КлючНастроек, НастройкиИнтеграции);
	//Сохраняет настройки в хранилище.
	//Вызов метода требует наличия права "СохранениеДанныхПользователя".
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИЗакрытьНаСервере()
	СохранитьНастройкиИнтеграции();
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	ЗаписатьИЗакрытьНаСервере();
	ЭтаФорма.Закрыть();
КонецПроцедуры

